app/Controllers/Api/V1/Cliente.php

SELECT *
FROM `cliente`
WHERE `id` = '1'
---
    public function index($id)
    {
        $query = $this->db->table('cliente')->select('*')->where('id', $id)->get();
        $client = $query->getRowArray();

INSERT INTO `cliente` (`nome`, `email`, `document`) VALUES ('Henrique', 'henrique@gmail.com', '00000000099')
---
    public function add()
    {
        $data = $this->request->getPost();
        $data['document'] = preg_replace('/[^0-9]/', '', $data['document']);

        $builder = $this->db->table('cliente');
        $builder->insert($data);