app/Controllers/Api/V1/Proposta.php

    public function change_status($id, $new_status)
    {
        $query = $this->db->table('proposta')->select('status')->where('id', $id)->get();
        $proposta = $query->getRowArray();

        if($proposta['status'] == 'DRAFT' && $new_status != 'SUBMITTED'){
            return $this->failNotFound('Proposta com status '.$proposta['status'].' não pode ser alterada para '.$new_status);
        }
        if($proposta['status'] == 'SUBMITTED' && !in_array($new_status, array('REJECTED', 'APPROVED'))){
            return $this->failNotFound('Proposta com status '.$proposta['status'].' não pode ser alterada para '.$new_status);
        }
        if($proposta['status'] == 'APPROVED' && $new_status != 'CANCELED'){
            return $this->failNotFound('Proposta com status '.$proposta['status'].' não pode ser alterada para '.$new_status);
        }
        if($proposta['status'] == 'REJECTED' || $proposta['status'] == 'CANCELED'){
            return $this->failNotFound('O status da proposta não pode mais ser alterado');
        }

        $this->db->table('proposta')->where('id', $id)->update(array('status' => $new_status));
---
UPDATE `proposta` SET `status` = 'APPROVED'
WHERE `id` = '1'