app/Controllers/Api/V1/Proposta.php

    public function index($id)
    {
        $query = $this->db->table('proposta')->select('*')->where('id', $id)->get();
        $proposta = $query->getRowArray();
---
SELECT *
FROM `proposta`
WHERE `proposta`.`deleted_at` IS NULL
AND `proposta`.`id` = '12'

    public function all()
    {
        $data = $this->request->getGet();
        $query = $this->db->table('proposta')->select('*');

        if( isset($data['titulo']) && $data['titulo'] != '')
            $query->like('produto', $data['titulo'], 'both');

        if( isset($data['status']) && $data['status'] != '')
            $query->where('status', $data['status']);

        if( isset($data['origem']) && $data['origem'] != '')
            $query->where('origem', $data['origem']);

        $limit = 20;
        if( isset($data['limit']) && $data['limit'] != '')
            $limit = $data['limit'];

        $page = 0 * $limit;
        if( isset($data['page']) && $data['page'] != '')
            $page = $limit * ($data['page'] - 1);

        $query->limit($limit, $page);

        $query = $query->get();
        $proposta = $query->getresultArray();
---
SELECT *
FROM `proposta`
WHERE `produto` LIKE '%Teste%' ESCAPE '!'
AND `origem` = 'API'
AND `proposta`.`deleted_at` IS NULL
 LIMIT 20

    public function add()
    {
        $data = $this->request->getPost();
        $data['status'] = 'DRAFT';

        $this->db->table('proposta')->insert($data);
        $insertId = $this->db->insertID();

        if( !isset($insertId) || !$insertId )
            return $this->failNotFound('Erro ao cadastrar nova proposta');

        $this->db->table('auditoria')->insert(array('proposta_id' => $insertId, 'actor' => 'user:1', 'evento' => 'CREATED', 'payload' => json_encode($data)));
---
INSERT INTO `proposta` (`cliente_id`, `produto`, `valor_mensal`, `origem`, `versao`, `status`) VALUES ('1', 'Produto de Teste 3', '22.9', 'APP', '1', 'DRAFT')
INSERT INTO `proposta` (`cliente_id`, `produto`, `valor_mensal`, `origem`, `versao`, `status`) VALUES ('1', 'Produto cadastrado com auditoria', '2', 'API', '1', 'DRAFT')
INSERT INTO `auditoria` (`proposta_id`, `actor`, `evento`, `payload`) VALUES (3, 'user:1', 'CREATED', '{\"cliente_id\":\"1\",\"produto\":\"Produto de Teste 3\",\"valor_mensal\":\"22.9\",\"origem\":\"APP\",\"versao\":\"1\",\"status\":\"DRAFT\"}')

    public function change_status($id, $new_status)
    {
        $query = $this->db->table('proposta')->select('status')->where('id', $id)->get();
        $proposta = $query->getRowArray();

        if($proposta['status'] == 'DRAFT' && $new_status != 'SUBMITTED'){
            return $this->failNotFound('Proposta com status '.$proposta['status'].' não pode ser alterada para '.$new_status);
        }
        if($proposta['status'] == 'SUBMITTED' && !in_array($new_status, array('REJECTED', 'APPROVED'))){
            return $this->failNotFound('Proposta com status '.$proposta['status'].' não pode ser alterada para '.$new_status);
        }
        if($proposta['status'] == 'APPROVED' && $new_status != 'CANCELED'){
            return $this->failNotFound('Proposta com status '.$proposta['status'].' não pode ser alterada para '.$new_status);
        }
        if($proposta['status'] == 'REJECTED' || $proposta['status'] == 'CANCELED'){
            return $this->failNotFound('O status da proposta não pode mais ser alterado');
        }

        $this->db->table('proposta')->where('id', $id)->update(array('status' => $new_status));

        $this->db->table('auditoria')->insert(array('proposta_id' => $id, 'actor' => 'user:1', 'evento' => 'STATUS_CHANGED', 'payload' => json_encode(array('status' => $proposta['status'], 'new_status' => $new_status))));
---
SELECT `status`
FROM `proposta`
WHERE `id` = '2'
SELECT `status`
FROM `proposta`
WHERE `proposta`.`deleted_at` IS NULL
AND `proposta`.`id` = '4'
UPDATE `proposta` SET `status` = 'APPROVED'
WHERE `id` = '2'
INSERT INTO `auditoria` (`proposta_id`, `actor`, `evento`, `payload`) VALUES ('4', 'user:1', 'STATUS_CHANGED', '{\"status\":\"DRAFT\",\"new_status\":\"SUBMITTED\"}')

    public function auditoria($id)
    {
        $query = $this->db->table('auditoria')->select('*')->where('proposta_id', $id)->get();
        $auditorias = $query->getResultArray();
---
SELECT *
FROM `auditoria`
WHERE `proposta_id` = '3'
SELECT *
FROM `auditoria`
WHERE `auditoria`.`id` = 'proposta_id'

    public function update($id)
    {
        $data = $this->request->getJSON(true);
        $proposta = $this->db->table('proposta')->select('*')->where('id', $id)->get()->getRowArray();

        if(intVal($proposta['versao']) !== $data['versao'])
            return $this->failNotFound('Proposta desatualizada, recarregue os dados com a versão atual e tente novamente!');

        if( !isset($proposta) || !$proposta)
            return $this->failNotFound('Proposta não encontrada!');

        $data['versao'] = $data['versao'] + 1;
        $this->db->table('proposta')->where('id', $id)->update($data);
---
SELECT *
FROM `proposta`
WHERE `id` = '2'
SELECT *
FROM `proposta`
WHERE `proposta`.`deleted_at` IS NULL
AND `proposta`.`id` = '2'